---
title: CutMarkType
classe: Autodesk.Revit.DB.Architecture.CutMarkType
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# CutMarkType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double CutLineAngle { get; set; }` | `cutMarkType.CutLineAngle` | Double |
| `Double CutLineDistance { get; set; }` | `cutMarkType.CutLineDistance` | Double |
| `Double CutLineExtension { get; set; }` | `cutMarkType.CutLineExtension` | Double |
| `CutLineType CutLineType { get; set; }` | `cutMarkType.CutLineType` | CutLineType |
| `CutMarkSymbol CutMarkSymbol { get; set; }` | `cutMarkType.CutMarkSymbol` | CutMarkSymbol |
| `Double CutMarkSymbolSize { get; set; }` | `cutMarkType.CutMarkSymbolSize` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```